In [1]:
import pandas as pd

<h2 style = "color:Green">Operations on Rows and Columns</h2>


1. Adding a new column to a DataFrame


2. Adding a new row to a DataFrame


3. Deleting rows from a DataFrame


4. Deleting columns from a DataFrame


5. Renaming row labels of a DataFrame


6. Renaming column labels of a DataFrame

In [2]:
# DataFrame from dictionary of lists

dfrc = pd.DataFrame({"Ramu":[50,60,70],"Samu":[45,65,95],"Rani":[89, 99, 79]}, index = ["Maths","Physics","Chemistry"])
dfrc

           Ramu  Samu  Rani
Maths        50    45    89
Physics      60    65    99
Chemistry    70    95    79

<h3 style = "color:Blue">1. Adding a new column to a DataFrame</h3>

In [3]:
# Adding a new column

dfrc["kishor"] = [50, 55, 54]
dfrc

           Ramu  Samu  Rani  kishor
Maths        50    45    89      50
Physics      60    65    99      55
Chemistry    70    95    79      54

In [4]:
# Modifying the values of existing column

dfrc["Rani"] = [70, 45, 67]
dfrc

           Ramu  Samu  Rani  kishor
Maths        50    45    70      50
Physics      60    65    45      55
Chemistry    70    95    67      54

In [5]:
# Assigning the same value to entire column

dfrc["kishor"] = "AB"
dfrc

           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    70    95    67     AB

<h3 style = "color:Blue">2. Adding a new row to a DataFrame</h3>


* **pandas.DataFram.loc["row_label"] = [list_of_values]** --> adds a new row with a given row_label and a list of its values.

In [6]:
# Adding a new row

dfrc.loc["English"] = [45, 76, 85, "AB"]
dfrc

           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    70    95    67     AB
English      45    76    85     AB

In [7]:
# Modifying existing row

dfrc.loc["English"] = [43, 74, 83, "AB"]
dfrc

           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    70    95    67     AB
English      43    74    83     AB

In [8]:
# Assigining a same value to entire row

dfrc.loc["Chemistry"] = 50
dfrc

           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB

<h3 style = "color:Blue">3. Deleting rows or columns of a DataFrame</h3>

 **pandas.DataFrame.drop(labels, axis = 0/1)** method returns a new DataFrame by removing specified rows/columns.
 
 * axis = 0 to delete rows (default)
 
 * axis = 1 to delete columns

In [9]:
dfrc

           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB

In [10]:
# Deleting a row 
dfdr1 = dfrc.drop("Chemistry", axis = 0)

dfdr1

         Ramu  Samu  Rani kishor
Maths      50    45    70     AB
Physics    60    65    45     AB
English    43    74    83     AB

In [11]:
dfrc

           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB

In [12]:
# Deleting multiple rows
dfdr2 = dfrc.drop(["Chemistry", "English"], axis = 0)

dfdr2

         Ramu  Samu  Rani kishor
Maths      50    45    70     AB
Physics    60    65    45     AB

In [13]:
dfrc

           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB

In [14]:
# Deleting a column
dfdc1 = dfrc.drop("kishor", axis = 1)

print(dfdc1)

print(dfrc)

           Ramu  Samu  Rani
Maths        50    45    70
Physics      60    65    45
Chemistry    50    50    50
English      43    74    83
           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB

In [15]:
# Deleting multiple columns
dfdc2 = dfrc.drop(["kishor", "Samu"], axis = 1)
print(dfdc2)

           Ramu  Rani
Maths        50    70
Physics      60    45
Chemistry    50    50
English      43    83

<h3 style = "color:Blue">4. Renaming rows or columns of a DataFrame</h3>


**pandas.DataFrame.rename(dictionary_of_old_new_labels, axis = 0/1)** method returns a new DataFrame after renaming rows/columns.

In [20]:
dfrc

           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB

In [21]:
#Renaming a row
dfr1 = dfrc.rename({"Maths":"Mathematics"}, axis = 0)

print(dfr1)
print(dfrc)

             Ramu  Samu  Rani kishor
Mathematics    50    45    70     AB
Physics        60    65    45     AB
Chemistry      50    50    50     50
English        43    74    83     AB
           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB

In [22]:
#Renaming multiple rows
dfr2 = dfrc.rename({"Maths":"Mathematics", "Physics":"Physical Science"}, axis = 0)

print(dfr2)
print(dfrc)

                  Ramu  Samu  Rani kishor
Mathematics         50    45    70     AB
Physical Science    60    65    45     AB
Chemistry           50    50    50     50
English             43    74    83     AB
           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB

In [23]:
# Renaming a column
dfc1 = dfrc.rename({"Ramu":"Ramam"}, axis = 1)

print(dfc1)
print(dfrc)

           Ramam  Samu  Rani kishor
Maths         50    45    70     AB
Physics       60    65    45     AB
Chemistry     50    50    50     50
English       43    74    83     AB
           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB

In [24]:
# Renaming multiple columns

dfc2 = dfrc.rename({"Samu":"Somesh", "kishor":"Ratnakishor"}, axis = 1)

print(dfc2)
print(dfrc)

           Ramu  Somesh  Rani Ratnakishor
Maths        50      45    70          AB
Physics      60      65    45          AB
Chemistry    50      50    50          50
English      43      74    83          AB
           Ramu  Samu  Rani kishor
Maths        50    45    70     AB
Physics      60    65    45     AB
Chemistry    50    50    50     50
English      43    74    83     AB